app/controllers/movies_controller.rb

  def index
    should_redirect = false
    @all_ratings = Movie.all_ratings
    if params[:ratings]
      @ratings = params[:ratings]
    elsif session[:ratings]
      @ratings = session[:ratings]
      should_redirect = true
    else
      @ratings = {}
      Movie.all_ratings.each do |rating|
---
SELECT "movies".* FROM "movies" ORDER BY release_date